Tekla.Structures.ModelInternal.dotRebarGroup_t
Serialization structure for RebarGroup.

Tekla.Structures.ModelInternal.dotRebarGroup_t.Reinforcement
The base class for all reinforcements.

Tekla.Structures.ModelInternal.dotRebarGroup_t.StartHook
The hook at the beginning of the reinforcing bar.

Tekla.Structures.ModelInternal.dotRebarGroup_t.EndHook
The hook at the end of the reinforcing bar.

Tekla.Structures.ModelInternal.dotRebarGroup_t.ExcludeType
Defines which bars to omit from the group.

Tekla.Structures.ModelInternal.dotRebarGroup_t.nPolygons
Number of polygons.

Tekla.Structures.ModelInternal.dotRebarGroup_t.nPointsInPolygon
Number of points in each polygon.

Tekla.Structures.ModelInternal.dotRebarGroup_t.aX
The x-coordinates of all points.

Tekla.Structures.ModelInternal.dotRebarGroup_t.aY
The y-coordinates of all points.

Tekla.Structures.ModelInternal.dotRebarGroup_t.aZ
The z-coordinates of all points.

Tekla.Structures.ModelInternal.dotRebarGroup_t.SpacingType
The type of spacing.

Tekla.Structures.ModelInternal.dotRebarGroup_t.nSpacingValues
Number of spacing values.

Tekla.Structures.ModelInternal.dotRebarGroup_t.aSpacingMultipliers
Spacing multiplier value(s).

Tekla.Structures.ModelInternal.dotRebarGroup_t.aSpacings
Spacing value(s).

Tekla.Structures.ModelInternal.dotRebarGroup_t.StirrupType
The type of stirrup.

Tekla.Structures.ModelInternal.dotRebarGroup_t.StartPoint
The start point of the direction in which the bars are distributed.

Tekla.Structures.ModelInternal.dotRebarGroup_t.EndPoint
The end point of the direction in which the bars are distributed.

Tekla.Structures.ModelInternal.dotRebarGroup_t.SubType
Defines rebar group type (group, curved, circle).